#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web/runs/run-XXrJuTppxidHkBkw

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E5VWR9I7KGZSJ]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=1920302536]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E3PO6D275Y4WSU]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js.map"]: Refreshing state... [id=static/js/777.3fc69ada.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.f04d7010.css.map"]: Refreshing state... [id=static/css/main.f04d7010.css.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/496.099941b1.chunk.js"]: Refreshing state... [id=static/js/496.099941b1.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js"]: Refreshing state... [id=static/js/777.3fc69ada.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js.map"]: Refreshing state... [id=static/js/915.2b20329f.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js.map"]: Refreshing state... [id=static/js/main.9a1d1ac2.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/main.f04d7010.css"]: Refreshing state... [id=static/css/main.f04d7010.css]
module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js"]: Refreshing state... [id=static/js/main.9a1d1ac2.js]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"]: Refreshing state... [id=static/js/726.e869980a.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.099941b1.chunk.js.map"]: Refreshing state... [id=static/js/496.099941b1.chunk.js.map]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js"]: Refreshing state... [id=static/js/106.74767f96.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"]: Refreshing state... [id=static/js/726.e869980a.chunk.js]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"]: Refreshing state... [id=static/css/915.35ba84bd.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js.map"]: Refreshing state... [id=static/js/106.74767f96.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"]: Refreshing state... [id=static/js/356.ab45c9e7.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.9a1d1ac2.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js"]: Refreshing state... [id=static/js/915.2b20329f.chunk.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/356.ab45c9e7.chunk.js.LICENSE.txt"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "056228b8efe2f6ed4fd2d44582d2ffe8" -> "15a1adb20cc720cc25211b826a1dc199"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "z4w_qKpLUOocboqpgUoA1_OujLE8mix0" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "d271d3d020df3c3579c57f2a2c3053e3" -> "15d380aac2c17b85f71d10d9d0076379"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "zEQhKJafnifByfPFSNEIspO_ZTVmSuAU" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.099941b1.chunk.js"] will be destroyed
  # (because key ["static/js/496.099941b1.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "4acbfe18368944a46e65540e5f85f94a" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/496.099941b1.chunk.js" -> null
      - key                    = "static/js/496.099941b1.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/496.099941b1.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "LP96eU3_lbm7cRaaTar2QRCaaNH4i5df" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.099941b1.chunk.js.map"] will be destroyed
  # (because key ["static/js/496.099941b1.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "3ea18808e435c7b5ef8cd5e16652e615" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/496.099941b1.chunk.js.map" -> null
      - key                    = "static/js/496.099941b1.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/496.099941b1.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "v.anUCwEtZxjxJglg7povQcNKkrfoWLh" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "04c7cdcdc176f4da16b66d6624cd0c36"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/496.c9f3cc61.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/496.c9f3cc61.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "38d4bc2e5ff8434c0105d54165fbf8dc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/496.c9f3cc61.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/496.c9f3cc61.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js"] will be destroyed
  # (because key ["static/js/main.9a1d1ac2.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "46a6eb900b87c1562a2bc173f5fc2ed4" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9a1d1ac2.js" -> null
      - key                    = "static/js/main.9a1d1ac2.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9a1d1ac2.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "cycGs.YUi5SweDFQ2XTBZEPvexR3CZaR" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.9a1d1ac2.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "63c7e8c8c109e59cec81dd0832390f86" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9a1d1ac2.js.LICENSE.txt" -> null
      - key                    = "static/js/main.9a1d1ac2.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9a1d1ac2.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "8BuKFDtnvwEKjxnOl6FFYQKZxrqf1aMM" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.9a1d1ac2.js.map"] will be destroyed
  # (because key ["static/js/main.9a1d1ac2.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "e90ad916a2c5539a71e35e4a3ea674b4" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.9a1d1ac2.js.map" -> null
      - key                    = "static/js/main.9a1d1ac2.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.9a1d1ac2.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "AZrmoPHV4exhYeuqt73ldE9EXLasfJTM" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e0aca6a4.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "98efca4f21dd781948faab8ffe4f95cd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e0aca6a4.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e0aca6a4.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e0aca6a4.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "63c7e8c8c109e59cec81dd0832390f86"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e0aca6a4.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e0aca6a4.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.e0aca6a4.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "cd391a57f83ebdee46d1442d51e1d1b1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.e0aca6a4.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.e0aca6a4.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 5 to add, 2 to change, 5 to destroy.

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*